Revit 2024 API
BuiltInFailures.OverlapFailures.DivisionSketchOverlap Property
 Curves in the sketch of the Division overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DivisionSketchOverlap { get; }
Visual Basic
Public Shared ReadOnly Property DivisionSketchOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DivisionSketchOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace